function chatBot() {

	// текущия вход от потребителя
	this.input;
	var brand="няма";
	var flavor="няма";
	var bowl="няма";
	var liquid="няма";
	var table=1;
	var reply= new Array();
	var counter;
	var turn;

	// връща отговора на бота
	this.respondTo = function(input) {
		counter=0;
		this.input = input.toLowerCase();
		//Поздрав
		if(this.match('(здрасти|здравейте|здравей|хей|какво става|как е|hello|holla|hi|hey)(\\s|!|\\.|\\,|\\?|$)'))
			return "Радвам се да ви видя!";
		
		//Асортимент
		if(this.match('(асортимента|асортиментът|асортимент)(\\s|!|\\.|\\,|\\?|$)'))
			return ["Разполагаме с тютюни на Ал Факер, Аргелини и Старбъз, с аромати на боровинка, нар, мента, ябълка, праскова, диня, грозде, портокал и фреш.",
			"Избрания тютюн може да поставим в малка или голяма чашка, а във вазата може да сложим вода, мляко и вино. Ако искате да проверите до къде сте стигнали с поръчката само попитайте."];


		// Избор на чашка - начало

		if(this.match('(чашки|чашките)(\\s|!|\\.|\\,|\\?|$)')){
			if(bowl=="няма"){
				return "Можете да избирате между малка и голяма чашка! Каква ще желаете?";
			}
			else{
				return "Вече сте избрали с каква чашка да е наргилето ви. Защо не опитате нещо друго?";
			}
		}
		if(this.match('(голяма|голяма чашка|малка|малка чашка|голямата|малката)(\\s|!|\\.|\\,|\\?|$)')){
			if(bowl=="няма"){
				if(this.match('(голяма|голяма чашка|голямата)(\\s|!|\\.|\\,|\\?|$)')) bowl="голяма";
				else bowl="малка";
				if(brand=="няма" || flavor=="няма" || liquid=="няма") {
				reply[counter]="Изборът на чашка за наргилето е наистина важен, а вашият бе добър!";
				counter++;
				}
				else return ["Изборът на чашка за наргилето е наистина важен, а вашият бе добър!","Поръчката ви бе успешно завършена. Очаквайте наргилето си всеки момент!"];
			}
			else{
				return "Вече сте избрали наргилето ви да бъде с "+bowl+" чашка.";
			}
		}
		// Избор на чашка - край

		// Избор на течност - начало

		if(this.match('(вода|водица|H2O|мляко|млеко|млекце|вино|винце)(\\s|!|\\.|\\,|\\?|$)')){
			if(liquid=="няма") {
				if(this.match('(вода|водица|H2O)(\\s|!|\\.|\\,|\\?|$)')) liquid="вода";
				else if(this.match('(мляко|млеко|млекце)(\\s|!|\\.|\\,|\\?|$)')) liquid="мляко";
				else liquid="вино";
				if(bowl=="няма" || brand=="няма" || flavor=="няма") {
					reply[counter]="Хмм..."+liquid+" ...интересен избор!";
					counter++;
				}
				else return ["Хмм..."+liquid+" ...интересен избор!","Поръчката ви бе успешно завършена. Очаквайте наргилето си всеки момент!"];
			}
			else{
				return "Вече сте избрали "+liquid+" като течност за наргилето си.";
			}
		}
		if(this.match('(течност|течността|течности)(\\s|!|\\.|\\,|\\?|$)')){
			if(liquid=="няма") return "В момента можем да ви предложим вода, мляко или вино, които да сложим във вашето наргиле! Коя ще изберете?";
			else return "Вече сте избрали "+liquid+" като течност за наргилето си.";

		}
		// Избор на течност - край

		// Избор на марка - начало
		if(this.match('(марка|марки|марки тютюн|марка тютюн|марките)(\\s|!|\\.|\\,|\\?|$)')){
			if(brand=="няма") return "Разполагаме с тютюни на Ал Факер, Аргелини и Старбъз! Кой ще желаете?";
			else return "Вече сте избрали марка на тютюна "+brand+".";
		}

		if(this.match('(ал факер|аргелини|аргилини|старбъз|алфакер|старбъс|стар бъз|стар бъс)(\\s|!|\\.|\\,|\\?|$)')){
			if(brand=="няма"){
				if(this.match('(ал факер|алфакер)(\\s|!|\\.|\\,|\\?|$)')) brand="Aл Факер";
				else if(this.match('(аргелини|аргилини)(\\s|!|\\.|\\,|\\?|$)')) brand="Аргелини";
				else brand="Старбъз";
				if(bowl=="няма" || flavor=="няма" || liquid=="няма") {
					reply[counter]=brand+" е един от най-добрите вкусове в момента, но все пак при този избор от марки тютюн нямаше как да сбъркате!";
					counter++;
				}
				else return [brand+" е един от най-добрите вкусове в момента, но все пак при този избор от марки тютюн нямаше как да сбъркате!","Поръчката ви бе успешно завършена. Очаквайте наргилето си всеки момент!"];
			}
			else return "Вече сте избрали марка на тютюна "+brand+".";
		}
		// Избор на марка - край

		// Избор на аромат - начало
		turn=0;
		if(this.match('(боровинка|борувинка|нар|мента|ябълка|ябалка|праскова|диня|грозде|портокал|фреш)(\\s|!|\\.|\\,|\\?|$)')){
			if(flavor=="няма"){
				if(this.match('(боровинка|борувинка)(\\s|!|\\.|\\,|\\?|$)')) flavor="Боровинка";
				else if(this.match('(нар)(\\s|!|\\.|\\,|\\?|$)')) flavor="Нар";
				else if(this.match('(мента)(\\s|!|\\.|\\,|\\?|$)')) flavor="Мента";
				else if(this.match('(ябълка|ябалка)(\\s|!|\\.|\\,|\\?|$)')) flavor="Ябълка";
				else if(this.match('(праскова)(\\s|!|\\.|\\,|\\?|$)')) flavor="Праскова";
				else if(this.match('(диня)(\\s|!|\\.|\\,|\\?|$)')) flavor="Диня";
				else if(this.match('(грозде)(\\s|!|\\.|\\,|\\?|$)')) flavor="Грозде";
				else if(this.match('(портокал)(\\s|!|\\.|\\,|\\?|$)')) flavor="Портокал";
				else flavor="Фреш";
				if(bowl=="няма" || brand=="няма" || liquid=="няма"){
					reply[counter]="Чудесен избор на аромат!";
					counter++;
					turn++;
				}
				else return ["Чудесен избор!","Поръчката ви бе успешно завършена. Очаквайте наргилето си всеки момент!"];
			}
			else return	"Вече сте избрали аромат на "+flavor+"." ;
		}
		
		if(this.match('(аромати|аромат|вкус|вкусове|ароматите|вкусовете)(\\s|!|\\.|\\,|\\?|$)')){
			if(flavor=="няма") return "Имаме боровинка, нар, мента, ябълка, праскова, диня, грозде, портокал и фреш. Какво ще желаете?";
			else if(turn==0) return	"Вече сте избрали аромат на "+flavor+"." ;
		}
		
		//Избор на аромат - край

		
		//Помощ
		if(this.match('(помощ|помогни|помогнеш|помогнете|помогнал)(\\s|!|\\.|\\,|\\?|$)'))
			return "Мога да ви помогна като ви разкажа с какво разполагаме в момента или просто си поговорим.";

		//Състояние на поръчката
		if(this.match('(състояние|състоянието|поръчка|поръчката|поръчал)(\\s|!|\\.|\\,|\\?|$)')){
			if(bowl=="няма" || brand=="няма" || liquid=="няма" || flavor=="няма") return ["До момента поръчката ви изглежда по следния начин:","Марка тютюн- "+brand,"Аромат на тютюна- "+flavor, "Течност- "+liquid, "Чашка- "+bowl];
			else return ["До момента поръчката ви изглежда по следния начин:","Марка тютюн- "+brand,"Аромат на тютюна- "+flavor, "Течност- "+liquid, "Чашка- "+bowl,"Поръчката ви е завършена. Очаквайте наргилето си скоро!"];
		}
		
		//Опит за промяна
		
		if(this.match('(променя|променям|сменям|сменя)'))
			return "Хвърлена дума- хвърлен камък! Не позволявам смени!";
		//Рандом- начало
		
		
		if(this.match('(препоръчай|препоръчайте|най-хубавото|най-доброто)'))
			return ["Имам няколко любими комбинации:", "Боровинка на Алфакер в голяма чашка, филтрирана от вода",
		"Мента на Старбъз, в малка чашка, с вино", "Шоколад на Аргелини с мляко, в голяма чашка"];
		
		if(this.match('л(ол)+') || this.match('(ха)+(х|$)'))
			return "Не разбирам кое е смешното?";

		if(this.match('(чао|довиждане|чао чао|до после)'))
			return ["До скоро!", "Надявам се да се видим пак!"];

		if(this.match('(как си|какво става|кп|ко става)'))
			return "Един чатбот винаги се чувства добре, но защо не наблегнем на избора на наргиле?";

		if(this.match('(истински ли си|реален ли си|интелигентен ли си|интелигентен|робот)'))
			return "Това си е моя работа :)...";
		if(this.match('(създател|създаден|създат)'))
			return "Аз съм създателя!";

		if(this.match('(как се казваш|името ти)'))
			return "Влади! Можеше да го забележиш!";

		if(this.match('(харесваш|обичаш|харесвате ли|обичате ли)'))
			return "Ха-ха, да не би да си помисли, че имам чувства?";

		if(this.match('(тъп|глупав)'))
			return "Не очакваш ли прекалено много от мен?";

		//Рандом- край
		if(counter>0) return reply;

		//Не разбира
		return input + "? За съжаление не разбрах! Бихте ли опитали отново?";
	}

	// проверява дали въведеното от потребителя съвпада с regex
	this.match = function(regex) {

		return new RegExp(regex).test(this.input);
	}
}
